# LineStyleId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..LineStyleId Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies the line style that is used for drawing Bending Detail curves.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId LineStyleId { get; set; }
```

Visual Basic
---
```text
Public Property LineStyleId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LineStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The lineStyleId should be an id of a line style. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace